In [3]:
import pandas as pd

In [36]:
df=pd.read_csv("book1.csv")

In [30]:
df

   Roll Name  Marks
0    10  abc     80
1    15  bca     90
2    25  cab     70
3    62  acb     75
4    32  cba     90
5    41  bac     86

In [31]:
df.shape

(6, 3)

In [32]:
df.head()

   Roll Name  Marks
0    10  abc     80
1    15  bca     90
2    25  cab     70
3    62  acb     75
4    32  cba     90

In [21]:
df.tail()

     Name  Marks
Roll
15    bca     90
25    cab     70
62    acb     75
32    cba     90
41    bac     86

In [17]:
df.ndim

2

In [18]:
df.info

<bound method DataFrame.info of    Roll Name  Marks
0    10  abc     80
1    15  bca     90
2    25  cab     70
3    62  acb     75
4    32  cba     90
5    41  bac     86>

In [20]:
df.iloc[1:2,1:2]

  Name
1  bca

In [21]:
df.size

18

In [33]:
df.shape

TypeError: 'tuple' object is not callable

In [32]:
df.columns

TypeError: 'Index' object is not callable

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Roll    6 non-null      int64
 1   Name    6 non-null      object
 2   Marks   6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes

In [30]:
df.memory_usage()

Index    128
Roll      48
Name      48
Marks     48
dtype: int64

In [46]:
df.loc[1:4]

   Roll Name  Marks
1    15  bca     90
2    25  cab     70
3    62  acb     75
4    32  cba     90

In [51]:
df.iloc[0,1]

'abc'

In [52]:
df.iloc[2:5,1]

2    cab
3    acb
4    cba
Name: Name, dtype: object

In [38]:
df[df['Roll']==10]#subset of filtering

   Roll Name  Marks
0    10  abc     80

In [55]:
df

   Roll Name  Marks
0    10  abc     80
1    15  bca     90
2    25  cab     70
3    62  acb     75
4    32  cba     90
5    41  bac     86

In [66]:
df[df['Roll']>20 & df['Marks']>80]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [68]:
sd=df[df['Marks']>80]
sd[sd['Roll']>20]

   Roll Name  Marks
4    32  cba     90
5    41  bac     86

In [44]:
df.at[0:4]

TypeError: DataFrame._get_value() missing 1 required positional argument: 'col'

In [70]:
df[(df['Marks']>80) & (df['Roll']>20)]

   Roll Name  Marks
4    32  cba     90
5    41  bac     86

In [19]:
df.iat[1,2]

90

In [11]:
pd.read_table('text.txt')

     Mca 1st sem
0  2022 po batch